{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "input_dtype": "float32", "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null, "nb_filter": 24, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 36, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 48, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_4", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_5", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 128, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1164, "trainable": true, "activation": "linear", "input_dim": 3072, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 100, "trainable": true, "activation": "linear", "input_dim": 1164, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 50, "trainable": true, "activation": "linear", "input_dim": 100, "name": "dense_3", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 20, "trainable": true, "activation": "linear", "input_dim": 50, "name": "dense_4", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "trainable": true, "activation": "linear", "input_dim": 20, "name": "dense_5", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}]}