{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 3, "bias": true, "W_regularizer": null, "nb_col": 1, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "batch_input_shape": [null, 64, 64, 3], "name": "convolution2d_1", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "input_dtype": "float32", "nb_row": 1, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "bias": true, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "bias": true, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "bias": true, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "bias": true, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "bias": true, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_6", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1164, "input_dim": 8192, "W_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 200, "input_dim": 1164, "W_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 100, "input_dim": 200, "W_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 20, "input_dim": 100, "W_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "input_dim": 20, "W_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_5"}}]}