{"keras_version": "1.2.0", "config": [{"config": {"activity_regularizer": null, "nb_filter": 24, "nb_col": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "nb_row": 5, "input_dtype": "float32", "batch_input_shape": [null, 80, 160, 3], "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_filter": 36, "trainable": true, "activation": "linear", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "nb_row": 5, "bias": true, "nb_col": 5, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_filter": 48, "trainable": true, "activation": "linear", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "nb_row": 5, "bias": true, "nb_col": 5, "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "trainable": true, "activation": "linear", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "nb_row": 3, "bias": true, "nb_col": 3, "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_filter": 128, "trainable": true, "activation": "linear", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "nb_row": 3, "bias": true, "nb_col": 3, "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "name": "dense_1", "input_dim": 3072, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 200, "name": "dense_2", "input_dim": 1164, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_3", "input_dim": 200, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 20, "name": "dense_4", "input_dim": 100, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_5", "input_dim": 20, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}